openfoam9/tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
    topAndBottom
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
    hot
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
    cold
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
